Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionResponse
Response for model version retrieval request.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionResponse.Download
Gets or sets the operation to download the file.
Only present if the request includes download format as a query parameter, and the format is available.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionResponse.Upload
Gets or sets the operation to upload a file to a version.
Only present if the request includes upload format as a query parameter.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionResponse.Version
Gets or sets the model version details.